Tekla Open API Reference for Tekla Structures 2025
RebarHeaderItem Properties
The RebarHeaderItem type exposes the following members.
Properties
Name | Description
Name
 Gets or sets the name.
PropertyName
 Gets or sets the property name.
Type
 Gets or sets the type.
Units
 Gets or sets the units.
Top
See Also
Reference
RebarHeaderItem Class
Tekla.Structures.Catalogs Namespace